
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |      12 |          1 |           9 |
## Affected resources by action

|  Action  | Resources                                                                                            |
|:--------:|:-----------------------------------------------------------------------------------------------------|
|    🟢     | `module.release_infrahouse_com["focal"].module.key.aws_secretsmanager_secret.secret`                 |
|    🟢     | `module.release_infrahouse_com["focal"].module.key.aws_secretsmanager_secret_version.current`        |
|    🟢     | `module.release_infrahouse_com["focal"].module.passphrase.aws_secretsmanager_secret.secret`          |
|    🟢     | `module.release_infrahouse_com["focal"].module.passphrase.aws_secretsmanager_secret_version.current` |
|    🟢     | `module.release_infrahouse_com["jammy"].module.key.aws_secretsmanager_secret.secret`                 |
|    🟢     | `module.release_infrahouse_com["jammy"].module.key.aws_secretsmanager_secret_version.current`        |
|    🟢     | `module.release_infrahouse_com["jammy"].module.passphrase.aws_secretsmanager_secret.secret`          |
|    🟢     | `module.release_infrahouse_com["jammy"].module.passphrase.aws_secretsmanager_secret_version.current` |
|    🟢     | `module.release_infrahouse_com["noble"].module.key.aws_secretsmanager_secret.secret`                 |
|    🟢     | `module.release_infrahouse_com["noble"].module.key.aws_secretsmanager_secret_version.current`        |
|    🟢     | `module.release_infrahouse_com["noble"].module.passphrase.aws_secretsmanager_secret.secret`          |
|    🟢     | `module.release_infrahouse_com["noble"].module.passphrase.aws_secretsmanager_secret_version.current` |
|    🟡     | `aws_iam_policy.package-publisher`                                                                   |
|    🔴     | `module.release_infrahouse_com["focal"].aws_secretsmanager_secret.key`                               |
|    🔴     | `module.release_infrahouse_com["focal"].aws_secretsmanager_secret.passphrase`                        |
|    🔴     | `module.release_infrahouse_com["focal"].aws_secretsmanager_secret_version.passphrase`                |
|    🔴     | `module.release_infrahouse_com["jammy"].aws_secretsmanager_secret.key`                               |
|    🔴     | `module.release_infrahouse_com["jammy"].aws_secretsmanager_secret.passphrase`                        |
|    🔴     | `module.release_infrahouse_com["jammy"].aws_secretsmanager_secret_version.passphrase`                |
|    🔴     | `module.release_infrahouse_com["noble"].aws_secretsmanager_secret.key`                               |
|    🔴     | `module.release_infrahouse_com["noble"].aws_secretsmanager_secret.passphrase`                        |
|    🔴     | `module.release_infrahouse_com["noble"].aws_secretsmanager_secret_version.passphrase`                |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.package-publisher will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "package-publisher" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-focal/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-jammy/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-noble/*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.package-publisher will be updated in-place
  ~ resource "aws_iam_policy" "package-publisher" {
        id               = "arn:aws:iam::493370826424:policy/package-publisher"
        name             = "package-publisher"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-release-focal/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-release-jammy/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-release-noble/*"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq",
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP",
                        ]
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG",
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP",
                        ]
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-noble-dtbTzd",
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-noble-FvoeWe",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["focal"].aws_secretsmanager_secret.key will be destroyed
  # (because aws_secretsmanager_secret.key is not in configuration)
  - resource "aws_secretsmanager_secret" "key" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP" -> null
      - description                    = "Signing GPG key for focal" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP" -> null
      - name                           = "packager-key-focal" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "created_by_module" = "infrahouse/debian-repo/aws"
        } -> null
      - tags_all                       = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/debian-repo/aws"
          - "environment"       = "production"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["focal"].aws_secretsmanager_secret.passphrase will be destroyed
  # (because aws_secretsmanager_secret.passphrase is not in configuration)
  - resource "aws_secretsmanager_secret" "passphrase" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq" -> null
      - description                    = "Passphrase for a signing GPG key for focal" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq" -> null
      - name                           = "packager-passphrase-focal" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "created_by_module" = "infrahouse/debian-repo/aws"
        } -> null
      - tags_all                       = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/debian-repo/aws"
          - "environment"       = "production"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["focal"].aws_secretsmanager_secret_version.passphrase will be destroyed
  # (because aws_secretsmanager_secret_version.passphrase is not in configuration)
  - resource "aws_secretsmanager_secret_version" "passphrase" {
      - arn            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq|6586EB13-79C2-424D-AFED-6810E61156D7" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "6586EB13-79C2-424D-AFED-6810E61156D7" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_secretsmanager_secret.key will be destroyed
  # (because aws_secretsmanager_secret.key is not in configuration)
  - resource "aws_secretsmanager_secret" "key" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP" -> null
      - description                    = "Signing GPG key for jammy" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP" -> null
      - name                           = "packager-key-jammy" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "created_by_module" = "infrahouse/debian-repo/aws"
        } -> null
      - tags_all                       = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/debian-repo/aws"
          - "environment"       = "production"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_secretsmanager_secret.passphrase will be destroyed
  # (because aws_secretsmanager_secret.passphrase is not in configuration)
  - resource "aws_secretsmanager_secret" "passphrase" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG" -> null
      - description                    = "Passphrase for a signing GPG key for jammy" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG" -> null
      - name                           = "packager-passphrase-jammy" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "created_by_module" = "infrahouse/debian-repo/aws"
        } -> null
      - tags_all                       = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/debian-repo/aws"
          - "environment"       = "production"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_secretsmanager_secret_version.passphrase will be destroyed
  # (because aws_secretsmanager_secret_version.passphrase is not in configuration)
  - resource "aws_secretsmanager_secret_version" "passphrase" {
      - arn            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG|D6ABCB2B-F850-4487-A764-07263736323E" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "D6ABCB2B-F850-4487-A764-07263736323E" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["noble"].aws_secretsmanager_secret.key will be destroyed
  # (because aws_secretsmanager_secret.key is not in configuration)
  - resource "aws_secretsmanager_secret" "key" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-noble-FvoeWe" -> null
      - description                    = "Signing GPG key for noble" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-noble-FvoeWe" -> null
      - name                           = "packager-key-noble" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "created_by_module" = "infrahouse/debian-repo/aws"
        } -> null
      - tags_all                       = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/debian-repo/aws"
          - "environment"       = "production"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["noble"].aws_secretsmanager_secret.passphrase will be destroyed
  # (because aws_secretsmanager_secret.passphrase is not in configuration)
  - resource "aws_secretsmanager_secret" "passphrase" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-noble-dtbTzd" -> null
      - description                    = "Passphrase for a signing GPG key for noble" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-noble-dtbTzd" -> null
      - name                           = "packager-passphrase-noble" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "created_by_module" = "infrahouse/debian-repo/aws"
        } -> null
      - tags_all                       = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/debian-repo/aws"
          - "environment"       = "production"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["noble"].aws_secretsmanager_secret_version.passphrase will be destroyed
  # (because aws_secretsmanager_secret_version.passphrase is not in configuration)
  - resource "aws_secretsmanager_secret_version" "passphrase" {
      - arn            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-noble-dtbTzd" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-noble-dtbTzd|terraform-20240720163142151600000003" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-noble-dtbTzd" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20240720163142151600000003" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["focal"].module.key.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.key/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["focal"].module.key.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Signing GPG key for focal"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "packager-key-focal"
      + name_prefix                    = (known after apply)
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.release_infrahouse_com["focal"].module.key.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "INITIAL",
        ]
    }

  # module.release_infrahouse_com["focal"].module.passphrase.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.passphrase/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["focal"].module.passphrase.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Passphrase for a signing GPG key for focal"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "packager-passphrase-focal"
      + name_prefix                    = (known after apply)
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.release_infrahouse_com["focal"].module.passphrase.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "AWSCURRENT",
        ]
    }

  # module.release_infrahouse_com["jammy"].module.key.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.key/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["jammy"].module.key.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Signing GPG key for jammy"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "packager-key-jammy"
      + name_prefix                    = (known after apply)
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.release_infrahouse_com["jammy"].module.key.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "INITIAL",
        ]
    }

  # module.release_infrahouse_com["jammy"].module.passphrase.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.passphrase/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["jammy"].module.passphrase.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Passphrase for a signing GPG key for jammy"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "packager-passphrase-jammy"
      + name_prefix                    = (known after apply)
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.release_infrahouse_com["jammy"].module.passphrase.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "AWSCURRENT",
        ]
    }

  # module.release_infrahouse_com["noble"].module.key.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.key/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["noble"].module.key.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Signing GPG key for noble"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "packager-key-noble"
      + name_prefix                    = (known after apply)
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.release_infrahouse_com["noble"].module.key.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "INITIAL",
        ]
    }

  # module.release_infrahouse_com["noble"].module.passphrase.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.passphrase/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["noble"].module.passphrase.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Passphrase for a signing GPG key for noble"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "packager-passphrase-noble"
      + name_prefix                    = (known after apply)
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }
      + tags_all                       = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
        }

      + replica (known after apply)
    }

  # module.release_infrahouse_com["noble"].module.passphrase.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "AWSCURRENT",
        ]
    }

Plan: 12 to add, 1 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEyLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiA5fX0=
```
</details>